/**********************************************************************
  Product     : Freenove 4WD Car for ESP32
  Auther      : www.freenove.com
  Modification: 2020/12/18
**********************************************************************/
#include "Freenove_4WD_Car_For_ESP32.h"

void setup()
{
  PCA9685_Setup();       // ініціалізація контролера моторів
}

void loop()
{

  Motor_Move(2000, 2000, 2000, 2000);     // рухатись вперед
  delay(1000);
  Motor_Move(0, 0, 0, 0);                    // зупинитись
  delay(1000);

  Motor_Move(-2000, -2000, -2000, -2000);     // рухатись назад
  delay(1000);
  Motor_Move(0, 0, 0, 0);                 // зупинитись
  delay(1000);


  Motor_Move(2000, 2000, -2000, -2000);   // повернути праворуч
  delay(1000);
  Motor_Move(0, 0, 0, 0);                 // зупинитись
  delay(1000);
  
  Motor_Move(-2000, -2000, 2000, 2000);   // повернути ліворуч
  delay(1000);
  Motor_Move(0, 0, 0, 0);                 // зупинитись
  delay(1000);
}
